src/InformationRegisters/ЖурналСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЖурналСообщений</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИдДиалога</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдОператора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдКанала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСообщения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Мессенджер</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Мессенджеры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстСообщенияUTF8</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СообщениеОтКлиента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОператорСообщения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Изображение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Аудио</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>PDF</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Прочитано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Триггер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдНаписавшегоВГруппу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОжиданиеСообщения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СлужебноеСообщение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоПересланноеСообщение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВнешняяСистема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ДанныеДиалоговЧатБотов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ДанныеДиалоговЧатБотов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаАктуализации</Name>
					<Comment>Универсальная дата</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АктуализированоПользователем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДанныеДиалога</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДиалогID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СценарийЧатБота</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииЧатБотов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/КэшВариантовОтветов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КэшВариантовОтветов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеОтвета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДанныеДиалога</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПредставлениеВарианта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЭтапаВозврата</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДиалогID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтветУчастника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ЖурналСообщений/Ext/RecordSetModule.bsl
#Область СлужебныйПрограммныйИнтерфейс
  
// Процедура - Перед записью
//
// Параметры:
//  Отказ		 - 	 - 
//  Замещение	 - 	 - 
//
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ЭтотОбъект.Количество() = 0 Тогда
		Возврат;		
	КонецЕсли;
	
	УстановкаФлагаПрочитано = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ЭтотОбъект.ДополнительныеСвойства, "УстановкаФлагаПрочитано", Ложь);
	
	Если УстановкаФлагаПрочитано Тогда 
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаЗаписьСообщения Из ЭтотОбъект Цикл 
		СтрокаЗаписьСообщения.ДатаРегистрации = ?(ЗначениеЗаполнено(СтрокаЗаписьСообщения.ДатаРегистрации), СтрокаЗаписьСообщения.ДатаРегистрации, ТекущаяДатаСеанса());
	КонецЦикла;	
		
КонецПроцедуры

// Процедура - При записи
//
// Параметры:
//  Отказ		 - 	 - 
//  Замещение	 - 	 - 
//
Процедура ПриЗаписи(Отказ, Замещение)

	Если ЭтотОбъект.Количество() = 0 Тогда
		Возврат;		
	КонецЕсли;
	
	ЗаписьСообщения = ЭтотОбъект[0];
	
	ДиалогID 				= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ЭтотОбъект.ДополнительныеСвойства, "ДиалогID"					, "");	
	УстановкаФлагаПрочитано = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ЭтотОбъект.ДополнительныеСвойства, "УстановкаФлагаПрочитано"	, Ложь);
	ЭтоИнициацияНовогоДиалогаСКлиентомИзСценария = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ЭтотОбъект.ДополнительныеСвойства, "ЭтоИнициацияНовогоДиалогаСКлиентомИзСценария", Ложь);
	
	Если УстановкаФлагаПрочитано Тогда 
		Возврат;
	КонецЕсли;
	
	Если ЗаписьСообщения.СлужебноеСообщение ИЛИ (ЗаписьСообщения.Триггер И НЕ ЗначениеЗаполнено(ДиалогID)) Тогда 
		Возврат;
	КонецЕсли;	
	                   
	Если ЗаписьСообщения.СообщениеОтКлиента И НЕ ЗаписьСообщения.ЭтоПересланноеСообщение Тогда
		Если НЕ ЭтоИнициацияНовогоДиалогаСКлиентомИзСценария Тогда 
			Справочники.СценарииЧатБотов.ИнтерпретироватьСообщениеПользователя(ЗаписьСообщения, ЭтотОбъект.ДополнительныеСвойства);
		КонецЕсли;	
		Возврат;
	КонецЕсли;	
	
	Если ЭтотОбъект.ОбменДанными.Загрузка = Истина
		И НЕ ЗначениеЗаполнено(ДиалогID) Тогда 		
		Возврат;
	КонецЕсли;		
	
	Если НЕ ЗначениеЗаполнено(ДиалогID) Тогда
		Возврат;
	КонецЕсли;	
	
	СценарийЧатБота 	= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ЭтотОбъект.ДополнительныеСвойства, "СценарийЧатБота"		, Неопределено);
	ДанныеСценария 		= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ЭтотОбъект.ДополнительныеСвойства, "ДанныеСценария"		, Неопределено);
	КэшВариантовОтветов = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ЭтотОбъект.ДополнительныеСвойства, "КэшВариантовОтветов"	, Неопределено);
	
	//Для Каждого Запись Из ЭтотОбъект Цикл
	// Актуализируем данные сценария
	Если ЗначениеЗаполнено(СценарийЧатБота) И ЗначениеЗаполнено(ДанныеСценария) Тогда 
		Если ТипЗнч(ДанныеСценария) = Тип("ТаблицаЗначений") Тогда 
			МассивСтруктур = ТаблицуЗначенийВМассивСтруктур(ДанныеСценария);
			Если ЗначениеЗаполнено(МассивСтруктур) Тогда 
				ДанныеСценария = МассивСтруктур[0];	
			КонецЕсли;	
		КонецЕсли;
		Если ТипЗнч(ДанныеСценария) = Тип("Структура") Тогда 
			РегистрыСведений.ДанныеДиалоговЧатБотов.ЗаписатьДанныеДиалоговЧатБота(ДиалогID
																				, СценарийЧатБота
																				, ?(ДанныеСценария.Свойство("Контрагент"), ДанныеСценария.Контрагент, Неопределено)
																				, ДанныеСценария
																				,
																				, Истина);
		КонецЕсли;
	КонецЕсли;
	// Закэшируем варианты ответов	
	Если ЗначениеЗаполнено(КэшВариантовОтветов) Тогда 
		РегистрыСведений.КэшВариантовОтветов.ЗакэшироватьВариантыОтветов(ДиалогID, КэшВариантовОтветов);	
	КонецЕсли;	
	//	Прервать;
	//КонецЦикла;
	
КонецПроцедуры


#КонецОбласти
